Revit 2027 API
TilePattern.TilePatternType Property
The built-in system tile pattern specified by this object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TilePatternsBuiltIn TilePatternType { get; }
Public ReadOnly Property TilePatternType As TilePatternsBuiltIn
	Get
public:
property TilePatternsBuiltIn TilePatternType {
	TilePatternsBuiltIn get ();
}
member TilePatternType : TilePatternsBuiltIn with get
Property Value
TilePatternsBuiltIn
See Also
Reference
TilePattern Class
Autodesk.Revit.DB Namespace